Documents/ВыпускПроизводственногоКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыпускПроизводственногоКомплекта</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыпускиПроизводственныхКомплектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКомплекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВыпускиПроизводственныхКомплектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыпускиПроизводственныхКомплектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВсеИзготовленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыпускПроизводственногоКомплекта/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	ИзделиеКомплект = ПроизводственныйКомплект.ИзделиеКомплект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныеКомплекты.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВыпускПроизводственногоКомплекта.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьВыпуск
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПроизводственногоКомплекта КАК ВыпускПроизводственногоКомплекта
		|		ПО (ВыпускПроизводственногоКомплекта.ПроизводственныйКомплект = ПроизводственныеКомплекты.Ссылка)
		|ГДЕ
		|	ПроизводственныеКомплекты.ИзделиеКомплект = &ИзделиеКомплект
		|	И ВыпускПроизводственногоКомплекта.Проведен";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВсеИзготовленно = Неопределено;
	
	
	Пока Выборка.Следующий() Цикл
		Если ВсеИзготовленно = Неопределено Тогда
			ВсеИзготовленно = Выборка.ЕстьВыпуск;
		ИначеЕсли НЕ Выборка.ЕстьВыпуск Тогда
			ВсеИзготовленно = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// регистр ВыпускиПроизводственныхКомплектов
	Движения.ВыпускиПроизводственныхКомплектов.Записывать = Истина;
	Движение = Движения.ВыпускиПроизводственныхКомплектов.Добавить();
	Движение.ИзделиеКомплект = ИзделиеКомплект;
	Движение.ВсеИзготовленно = ВсеИзготовленно;

КонецПроцедуры
